eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСРЖД/абс_ПоступлениеОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПоступлениеОСРЖД</name>
  <basedOn>Document.ПринятиеКУчетуОС</basedOn>
  <basedOn>Document.МодернизацияОС</basedOn>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСРЖД</registerRecords>
  <registerRecords>AccountingRegister.абс_МеждународныйОСРЖД</registerRecords>
  <registerRecords>InformationRegister.абс_ОсновныеСредстваРЖД</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестонахождениеОбъекта</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокПолезногоИспользования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисленнойАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправедливаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УбытокОтОбесценения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетНачисленияАмортизации</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетСниженияСтоимости</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодНачисленияАмортизации</name>
      <type>
        <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредполагаемыйОбъемПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСчет</name>
      <type>
        <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСубконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСубконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>КоррСубконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОсновныеСредстваРЖД/абс_ОсновныеСредстваРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОсновныеСредстваРЖД</name>
  <comment>(Упр) Сведения об объектах ОС  для целей РЖД</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный РЖД</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.абс_МеждународныйОСРЖД</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСРЖД/Forms/ФормаДокументаУправляемая/Module.bsl
/////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	
КонецПроцедуры



/////////////////////////////////////////////////////////////////////////////////
// Обработчики событий элементов формы

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	ДокументОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Док = РеквизитФормыВЗначение("Объект");
	Док.Заполнить(Объект.ДокументОснование);
	ЗначениеВРеквизитФормы(Док, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	СтрокиОсновногоСредства = Объект.ОсновныеСредства.НайтиСтроки(Новый Структура("ОсновноеСредство", ТекущиеДанные.ОсновноеСредство));
	Если СтрокиОсновногоСредства.Количество()>1 Тогда
		Для Каждого СтрокаОС Из СтрокиОсновногоСредства Цикл
			Если СтрокаОС.НомерСтроки<>ТекущиеДанные.НомерСтроки Тогда
				ЗаполнитьЗначенияСвойств(ТекущиеДанные, СтрокаОС);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПараметрыОС = ПолучитьПараметрыОсновногоСредства(ТекущиеДанные.ОсновноеСредство);
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ПараметрыОС);
	КонецЕсли;
	
	ТекущиеДанные.Стоимость = 0;
	ТекущиеДанные.СуммаНачисленнойАмортизации = 0;
	ТекущиеДанные.СправедливаяСтоимость = 0;
	ТекущиеДанные.ЛиквидационнаяСтоимость = 0;
	ТекущиеДанные.УбытокОтОбесценения = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПараметрыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	ОсновноеСредство = ТекущиеДанные.ОсновноеСредство;
	Если Не ЗначениеЗаполнено(ОсновноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Сред(Элемент.Имя, 17);
	ЗначениеКолонки = ТекущиеДанные[ИмяКолонки];
	
	Для Каждого СтрокаОС Из Объект.ОсновныеСредства Цикл
		Если СтрокаОС.ОсновноеСредство=ОсновноеСредство Тогда
			СтрокаОС[ИмяКолонки] = ЗначениеКолонки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// Обработчики команд формы

&НаКлиенте
Процедура ЗаполнитьПоОснованию(Команда)
	
	ДокументОснованиеПриИзмененииНаСервере();
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыОсновногоСредства(ОсновноеСредство)
	
	Возврат РегистрыСведений.абс_ОсновныеСредстваРЖД.ПолучитьПоследнее( , Новый Структура("ОсновноеСредство", ОсновноеСредство));
	
КонецФункции
